/* Keychain Attribute Type Names. */

/* The key is the four-character-code value as defined in SecKeychainItem.h in Apple's Security framework.  Last updated for 10.4.10. */
/* The value is human-readable name of the attribute type. */

"cdat" = "Creation Date";
"mdat" = "Modification Date";
"desc" = "Description";
"icmt" = "Comment";
"crtr" = "Creator";
"type" = "Type";
"scrp" = "Script Code";
"labl" = "Label";
"invi" = "Invisible";
"nega" = "Negative";
"cusi" = "Custom Icon";
"acct" = "Account";
"svce" = "Service";
"gena" = "Generic";
"sdmn" = "Security Domain";
"srvr" = "Server";
"atyp" = "Authentication Type";
"port" = "Port";
"path" = "Path";
"vlme" = "AppleShare Volume";
"addr" = "AppleShare Address";
"ssig" = "AppleShare Signature";
"ptcl" = "Protocol";
"ctyp" = "Certificate Type";
"cenc" = "Certificate Encoding";
"crtp" = "CRL Type";
"crnc" = "CRL Encoding";
"alis" = "Alias";